# Dataset initalization

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
data = pd.read_csv("/content/drive/My Drive/datasets/data.csv",encoding="ISO-8859-1")
cd = pd.read_csv("/content/drive/My Drive/datasets/city_day.csv",encoding="ISO-8859-1")
data.fillna(0,inplace=True)
cd.fillna(0,inplace=True)

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

# AQI calculation

In [ ]:
def calculate_si(so2):
    si=0
    if (so2<=40):
     si= so2*(50/40)
    if (so2>40 and so2<=80):
     si= 50+(so2-40)*(50/40)
    if (so2>80 and so2<=380):
     si= 100+(so2-80)*(100/300)
    if (so2>380 and so2<=800):
     si= 200+(so2-380)*(100/800)
    if (so2>800 and so2<=1600):
     si= 300+(so2-800)*(100/800)
    if (so2>1600):
     si= 400+(so2-1600)*(100/800)
    return si
data['si']=data['so2'].apply(calculate_si)
df= data[['so2','si']]
df.head()

   so2     si
0  4.8  6.000
1  3.1  3.875
2  6.2  7.750
3  6.3  7.875
4  4.7  5.875

In [ ]:
def calculate_ni(no2):
    ni=0
    if(no2<=40):
     ni= no2*50/40
    elif(no2>40 and no2<=80):
     ni= 50+(no2-14)*(50/40)
    elif(no2>80 and no2<=180):
     ni= 100+(no2-80)*(100/100)
    elif(no2>180 and no2<=280):
     ni= 200+(no2-180)*(100/100)
    elif(no2>280 and no2<=400):
     ni= 300+(no2-280)*(100/120)
    else:
     ni= 400+(no2-400)*(100/120)
    return ni
data['ni']=data['no2'].apply(calculate_ni)
df= data[['no2','ni']]
df.head()

    no2      ni
0  17.4  21.750
1   7.0   8.750
2  28.5  35.625
3  14.7  18.375
4   7.5   9.375

In [ ]:

def calculate_(rspm):
    rpi=0
    if(rpi<=30):
     rpi=rpi*50/30
    elif(rpi>30 and rpi<=60):
     rpi=50+(rpi-30)*50/30
    elif(rpi>60 and rpi<=90):
     rpi=100+(rpi-60)*100/30
    elif(rpi>90 and rpi<=120):
     rpi=200+(rpi-90)*100/30
    elif(rpi>120 and rpi<=250):
     rpi=300+(rpi-120)*(100/130)
    else:
     rpi=400+(rpi-250)*(100/130)
    return rpi
data['rpi']=data['rspm'].apply(calculate_si)
df= data[['rspm','rpi']]
df.tail()

         rspm         rpi
435737  143.0  121.000000
435738  171.0  130.333333
435739    0.0    0.000000
435740    0.0    0.000000
435741    0.0    0.000000

In [ ]:
def calculate_spi(spm):
    spi=0
    if(spm<=50):
     spi=spm
    if(spm<50 and spm<=100):
     spi=spm
    elif(spm>100 and spm<=250):
     spi= 100+(spm-100)*(100/150)
    elif(spm>250 and spm<=350):
     spi=200+(spm-250)
    elif(spm>350 and spm<=450):
     spi=300+(spm-350)*(100/80)
    else:
     spi=400+(spm-430)*(100/80)
    return spi
data['spi']=data['spm'].apply(calculate_spi)
df= data[['spm','spi']]
df.tail()

        spm  spi
435737  0.0  0.0
435738  0.0  0.0
435739  0.0  0.0
435740  0.0  0.0
435741  0.0  0.0

In [ ]:
def calculate_aqi(si,ni,spi,rpi):
    aqi=0
    if(si>ni and si>spi and si>rpi):
     aqi=si
    if(spi>si and spi>ni and spi>rpi):
     aqi=spi
    if(ni>si and ni>spi and ni>rpi):
     aqi=ni
    if(rpi>si and rpi>ni and rpi>spi):
     aqi=rpi
    return aqi
data['AQI']=data.apply(lambda x:calculate_aqi(x['si'],x['ni'],x['spi'],x['rpi']),axis=1)
df= data[['sampling_date','state','si','ni','rpi','spi','AQI']]
df.head()

        sampling_date           state     si      ni  rpi  spi     AQI
0  February - M021990  Andhra Pradesh  6.000  21.750  0.0  0.0  21.750
1  February - M021990  Andhra Pradesh  3.875   8.750  0.0  0.0   8.750
2  February - M021990  Andhra Pradesh  7.750  35.625  0.0  0.0  35.625
3     March - M031990  Andhra Pradesh  7.875  18.375  0.0  0.0  18.375
4     March - M031990  Andhra Pradesh  5.875   9.375  0.0  0.0   9.375

# Dataset Cleaning

In [ ]:
cd

                City        Date  PM2.5  ...  Xylene   AQI    AQI_Bucket
0          Ahmedabad  2015-01-01   0.00  ...    0.00   0.0             0
1          Ahmedabad  2015-01-02   0.00  ...    3.77   0.0             0
2          Ahmedabad  2015-01-03   0.00  ...    2.25   0.0             0
3          Ahmedabad  2015-01-04   0.00  ...    1.00   0.0             0
4          Ahmedabad  2015-01-05   0.00  ...    2.78   0.0             0
...              ...         ...    ...  ...     ...   ...           ...
29526  Visakhapatnam  2020-06-27  15.02  ...    0.73  41.0          Good
29527  Visakhapatnam  2020-06-28  24.38  ...    0.38  70.0  Satisfactory
29528  Visakhapatnam  2020-06-29  22.91  ...    0.00  68.0  Satisfactory
29529  Visakhapatnam  2020-06-30  16.64  ...    0.00  54.0  Satisfactory
29530  Visakhapatnam  2020-07-01  15.00  ...    0.00  50.0          Good

[29531 rows x 16 columns]

In [ ]:
cd['City'].unique()

array(['Ahmedabad', 'Aizawl', 'Amaravati', 'Amritsar', 'Bengaluru',
       'Bhopal', 'Brajrajnagar', 'Chandigarh', 'Chennai', 'Coimbatore',
       'Delhi', 'Ernakulam', 'Gurugram', 'Guwahati', 'Hyderabad',
       'Jaipur', 'Jorapokhar', 'Kochi', 'Kolkata', 'Lucknow', 'Mumbai',
       'Patna', 'Shillong', 'Talcher', 'Thiruvananthapuram',
       'Visakhapatnam'], dtype=object)

In [ ]:
data

       stn_code       sampling_date  ...  spi         AQI
0           150  February - M021990  ...  0.0   21.750000
1           151  February - M021990  ...  0.0    8.750000
2           152  February - M021990  ...  0.0   35.625000
3           150     March - M031990  ...  0.0   18.375000
4           151     March - M031990  ...  0.0    9.375000
...         ...                 ...  ...  ...         ...
435737     SAMP            24-12-15  ...  0.0  121.000000
435738     SAMP            29-12-15  ...  0.0  130.333333
435739        0                   0  ...  0.0    0.000000
435740        0                   0  ...  0.0    0.000000
435741        0                   0  ...  0.0    0.000000

[435742 rows x 18 columns]

In [ ]:
data = data[['date','AQI','location']]

In [ ]:
cd = cd[['Date','AQI','City']]

In [ ]:
data=data.rename(columns={'date':'Date','location':'City'})

In [ ]:
df = pd.concat([data,cd],ignore_index=True)

In [ ]:
df

              Date     AQI           City
0       1990-02-01  21.750      Hyderabad
1       1990-02-01   8.750      Hyderabad
2       1990-02-01  35.625      Hyderabad
3       1990-03-01  18.375      Hyderabad
4       1990-03-01   9.375      Hyderabad
...            ...     ...            ...
465268  2020-06-27  41.000  Visakhapatnam
465269  2020-06-28  70.000  Visakhapatnam
465270  2020-06-29  68.000  Visakhapatnam
465271  2020-06-30  54.000  Visakhapatnam
465272  2020-07-01  50.000  Visakhapatnam

[465273 rows x 3 columns]

In [ ]:
MumbaiAQI = df[df['City']=='Mumbai'] 
MumbaiAQI = MumbaiAQI[['Date','AQI']]
MumbaiAQI.to_csv(r"/content/drive/My Drive/datasets/MumbaiAQI.csv")

In [ ]:
AhmedabadAQI = df[df['City']=='Ahmedabad'] 
AhmedabadAQI = AhmedabadAQI[['Date','AQI']]
AhmedabadAQI.to_csv(r"/content/drive/My Drive/datasets/AhmedabadAQI.csv")

In [ ]:
AizawlAQI = df[df['City']=='Aizawl'] 
AizawlAQI = AizawlAQI[['Date','AQI']]
AizawlAQI.to_csv(r"/content/drive/My Drive/datasets/AizawlAQI.csv")

In [ ]:
AmritsarAQI = df[df['City']=='Amritsar'] 
AmritsarAQI = AmritsarAQI[['Date','AQI']]
AmritsarAQI.to_csv(r"/content/drive/My Drive/datasets/AmritsarAQI.csv")

In [ ]:
BengaluruAQI = df[(df['City']=='Bengaluru')] 
BengaluruAQI = BengaluruAQI[['Date','AQI']]
BengaluruAQI.to_csv(r"/content/drive/My Drive/datasets/BengaluruAQI.csv")

In [ ]:
BhopalAQI = df[df['City']=='Bhopal' ] 
BhopalAQI = BhopalAQI[['Date','AQI']]
BhopalAQI.to_csv(r"/content/drive/My Drive/datasets/BhopalAQI.csv")

In [ ]:
BhubaneshwarAQI = df[(df['City']=='Bhubaneswar') | (df['City']=='Bhubaneshwar')|(df['City']=='Brajrajnagar')] 
BhubaneshwarAQI = BhubaneshwarAQI[['Date','AQI']]
BhubaneshwarAQI.to_csv(r"/content/drive/My Drive/datasets/BhubaneshwarAQI.csv")

In [ ]:
ChandigarhAQI = df[df['City']=='Chandigarh' ] 
ChandigarhAQI = ChandigarhAQI[['Date','AQI']]
ChandigarhAQI.to_csv(r"/content/drive/My Drive/datasets/ChandigarhAQI.csv")

In [ ]:
ChennaiAQI = df[df['City']=='Chennai' ] 
ChennaiAQI = ChennaiAQI[['Date','AQI']]
ChennaiAQI.to_csv(r"/content/drive/My Drive/datasets/ChennaiAQI.csv")

In [ ]:
DelhiAQI = df[df['City']=='Delhi' ] 
DelhiAQI = DelhiAQI[['Date','AQI']]
DelhiAQI.to_csv(r"/content/drive/My Drive/datasets/DelhiAQI.csv")

In [ ]:
GurugramAQI = df[df['City']=='Gurugram' ] 
GurugramAQI = GurugramAQI[['Date','AQI']]
GurugramAQI.to_csv(r"/content/drive/My Drive/datasets/GurugramAQI.csv")

In [ ]:
GuwahatiAQI = df[df['City']=='Guwahati' ] 
GuwahatiAQI = GuwahatiAQI[['Date','AQI']]
GuwahatiAQI.to_csv(r"/content/drive/My Drive/datasets/GuwahatiAQI.csv")

In [ ]:
HyderabadAQI = df[df['City']=='Hyderabad' ] 
HyderabadAQI = HyderabadAQI[['Date','AQI']]
HyderabadAQI.to_csv(r"/content/drive/My Drive/datasets/HyderabadAQI.csv")

In [ ]:
JaipurAQI = df[df['City']=='Jaipur' ] 
JaipurAQI = JaipurAQI[['Date','AQI']]
JaipurAQI.to_csv(r"/content/drive/My Drive/datasets/JaipurAQI.csv")

In [ ]:
JorapokharAQI = df[df['City']=='Jorapokhar' ] 
JorapokharAQI = JorapokharAQI[['Date','AQI']]
JorapokharAQI.to_csv(r"/content/drive/My Drive/datasets/JorapokharAQI.csv")

In [ ]:
KolkataAQI = df[df['City']=='Kolkata' ] 
KolkataAQI = KolkataAQI[['Date','AQI']]
KolkataAQI.to_csv(r"/content/drive/My Drive/datasets/KolkataAQI.csv")

In [ ]:
LucknowAQI = df[df['City']=='Lucknow' ] 
LucknowAQI = LucknowAQI[['Date','AQI']]
LucknowAQI.to_csv(r"/content/drive/My Drive/datasets/LucknowAQI.csv")

In [ ]:
PatnaAQI = df[df['City']=='Patna' ] 
PatnaAQI = PatnaAQI[['Date','AQI']]
PatnaAQI.to_csv(r"/content/drive/My Drive/datasets/PatnaAQI.csv")

In [ ]:
ShillongAQI = df[df['City']=='Shillong' ] 
ShillongAQI = ShillongAQI[['Date','AQI']]
ShillongAQI.to_csv(r"/content/drive/My Drive/datasets/ShillongAQI.csv")

In [ ]:
ThiruvananthapuramAQI = df[df['City']=='Thiruvananthapuram' ] 
ThiruvananthapuramAQI = ThiruvananthapuramAQI[['Date','AQI']]
ThiruvananthapuramAQI.to_csv(r"/content/drive/My Drive/datasets/ThiruvananthapuramAQI.csv")

In [ ]:
VisakhapatnamAQI = df[df['City']=='Visakhapatnam' ] 
VisakhapatnamAQI = VisakhapatnamAQI[['Date','AQI']]
VisakhapatnamAQI.to_csv(r"/content/drive/My Drive/datasets/VisakhapatnamAQI.csv")